pranavek/esp32-cyd-weather-station/src/Esp32_CYD_TFT_eSPI_OpenWeather_LittleFS_v02.ino
  // PWM backlight on TFT_BL — fixed level from SCREEN_BRIGHTNESS.
  ledcSetup(0, 5000, 8);          // channel 0, 5 kHz, 8-bit
  ledcAttachPin(TFT_BL, 0);
  setBacklight(SCREEN_BRIGHTNESS);

  // Load runtime config (NVS overrides on top of All_Settings.h defaults).
  // If the user hasn't configured the device yet (either by editing
  // All_Settings.h or via the captive portal), launch the portal — it
  // takes over the screen and reboots on save.
  configBegin(WIFI_SSID, WIFI_PASSWORD,
              api_key, latitude, longitude, units,
              _RTC_XSTR(TIMEZONE), &TIMEZONE,
              NIGHT_OFF_HOUR, NIGHT_ON_HOUR);
  if (!configIsReady()) {
    startCaptivePortal();  // never returns
  }

  if (!LittleFS.begin()) {
    Serial.println("Flash FS initialisation failed!");
    while (1) yield();  // Stay here twiddling thumbs waiting
  }
  Serial.println("\nFlash FS available!");

// Enable if you want to erase LittleFS, this takes some time!
// then disable and reload sketch to avoid reformatting on every boot!
#ifdef FORMAT_LittleFS
  tft.setTextDatum(BC_DATUM);  // Bottom Centre datum
  tft.drawString("Formatting LittleFS, so wait!", 120, 195);
  LittleFS.format();
#endif

  TJpgDec.setJpgScale(1);
  TJpgDec.setCallback(tft_output);
  TJpgDec.setSwapBytes(true);  // May need to swap the jpg colour bytes (endianess)

  // Draw splash screen
  if (LittleFS.exists("/splash/OpenWeather.jpg") == true) {
    TJpgDec.drawFsJpg(0, 40, "/splash/OpenWeather.jpg", LittleFS);
  }

  delay(2000);

  // Clear bottom section of screen
  tft.fillRect(0, 206, 240, 320 - 206, TFT_BLACK);

  tft.loadFont(AA_FONT_SMALL, LittleFS);
  tft.setTextDatum(BC_DATUM);  // Bottom Centre datum
  tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);

  tft.drawString("Original by: blog.squix.org", 120, 260);
  tft.drawString("Adapted by: Bodmer", 120, 280);

  tft.setTextColor(TFT_YELLOW, TFT_BLACK);

  delay(2000);

  tft.fillRect(0, 206, 240, 320 - 206, TFT_BLACK);

  tft.drawString("Connecting to WiFi", 120, 240);
  tft.setTextPadding(240);  // Pad next drawString() text to full width to over-write old text

// Call once for ESP32 and ESP8266
#if !defined(ARDUINO_ARCH_MBED)
  WiFi.begin(cfg.wifiSsid.c_str(), cfg.wifiPassword.c_str());
#endif

  while (WiFi.status() != WL_CONNECTED) {
    Serial.print(".");
#if defined(ARDUINO_ARCH_MBED) || defined(ARDUINO_ARCH_RP2040)
    if (WiFi.status() != WL_CONNECTED) WiFi.begin(cfg.wifiSsid.c_str(), cfg.wifiPassword.c_str());
#endif
    delay(500);
  }
  Serial.println();

  tft.setTextDatum(BC_DATUM);
  tft.setTextPadding(240);        // Pad next drawString() text to full width to over-write old text
  tft.drawString(" ", 120, 220);  // Clear line above using set padding width
  tft.drawString("Fetching weather data...", 120, 240);

  // Fetch the time
  udp.begin(localPort);
  syncTime();

  tft.unloadFont();
}

/***************************************************************************************
**                          Loop
***************************************************************************************/
void loop() {
  time_t local_t = currentTZ()->toLocal(now(), &tz1_Code);
  uint8_t h = hour(local_t);
  uint8_t m = minute(local_t);
  bool nightMode = !booted &&
                   ((h < cfg.nightOnHour) || (h == cfg.nightOffHour && m >= 59));

  updateBrightness(nightMode);

  // Weather update — timer not advanced during night so wake-up fetch is immediate
  if (booted || (millis() - lastDownloadUpdate > 1000UL * UPDATE_INTERVAL_SECS)) {
    if (!nightMode) {
      updateData();
      lastDownloadUpdate = millis();
    }
  }

  // Clock update — skip draw and NTP sync during night
  if (booted || minute() != lastMinute) {
    lastMinute = minute();
    if (!nightMode) {
      drawTime();
      syncTime();
    }
#ifdef SCREEN_SERVER
    screenServer();
#endif
  }

  // Carousel — cycle bottom sections every 15 seconds
  if (!nightMode && cacheValid && (millis() - lastPageCycle >= 15000UL)) {
    lastPageCycle = millis();
    currentPage = (currentPage + 1) % PAGE_COUNT;
    tft.loadFont(AA_FONT_SMALL, LittleFS);
    tft.fillRect(0, 154, 240, 166, TFT_BLACK);
    drawBottomSections();
    tft.unloadFont();
  }

  booted = false;
}

/***************************************************************************************
**                          Fetch the weather data  and update screen
***************************************************************************************/
// Update the Internet based information and update screen
void updateData() {
  // booted = true;  // Test only
  // booted = false; // Test only

  if (booted) drawProgress(20, "Updating time...");
  else fillSegment(22, 22, 0, (int)(20 * 3.6), 16, TFT_NAVY);

  if (booted) drawProgress(50, "Updating conditions...");
  else fillSegment(22, 22, 0, (int)(50 * 3.6), 16, TFT_NAVY);

  // Create the structure that holds the retrieved weather
  forecast = new OW_forecast;

  String lat = cfg.latitude;
  String lon = cfg.longitude;

#ifdef RANDOM_LOCATION  // Randomly choose a place on Earth to test icons etc
  lat = String(random(180) - 90);
  lon = String(random(360) - 180);
  Serial.print("Lat = ");
  Serial.print(lat);
  Serial.print(", Lon = ");
  Serial.println(lon);
#endif

  bool parsed = ow.getForecast(forecast, cfg.apiKey, lat, lon, cfg.units, language);

  if (parsed) Serial.println("Data points received");
  else Serial.println("Failed to get data points");

  //Serial.print("Free heap = "); Serial.println(ESP.getFreeHeap(), DEC);

  printWeather();  // For debug, turn on output with #define SERIAL_MESSAGES

  if (booted) {
    drawProgress(100, "Done...");
    delay(2000);
    tft.fillScreen(TFT_BLACK);
  } else {
    fillSegment(22, 22, 0, 360, 16, TFT_NAVY);
    fillSegment(22, 22, 0, 360, 22, TFT_BLACK);
  }

  if (parsed) {
    cacheForecastData();    // snapshot needed values before forecast is deleted

    tft.loadFont(AA_FONT_SMALL, LittleFS);
    drawCurrentWeather();
    tft.fillRect(0, 154, 240, 166, TFT_BLACK);  // clear bottom region for fresh page
    drawBottomSections();
    tft.unloadFont();

    // Update the temperature here so we don't need to keep
    // loading and unloading font which takes time
    tft.loadFont(AA_FONT_LARGE, LittleFS);
    tft.setTextDatum(TR_DATUM);
    tft.setTextColor(TFT_YELLOW, TFT_BLACK);

    // Font ASCII code 0xB0 is a degree symbol, but o used instead in small font
    tft.setTextPadding(tft.textWidth(" -88"));  // Max width of values

    String weatherText = "";
    weatherText = String(forecast->temp[0], 0);  // Make it integer temperature
    tft.drawString(weatherText, 215, 95);        //  + "°" symbol is big... use o in small font
    tft.unloadFont();
  } else {
    Serial.println("Failed to get weather");
  }

  // Delete to free up space
  delete forecast;
  forecast = nullptr;

