pranavek/esp32-cyd-weather-station/src/Esp32_CYD_TFT_eSPI_OpenWeather_LittleFS_v02.ino
}

/***************************************************************************************
**                          Update progress bar
***************************************************************************************/
void drawProgress(uint8_t percentage, String text) {
  tft.loadFont(AA_FONT_SMALL, LittleFS);
  tft.setTextDatum(BC_DATUM);
  tft.setTextColor(TFT_ORANGE, TFT_BLACK);
  tft.setTextPadding(240);
  tft.drawString(text, 120, 260);

  ui.drawProgressBar(10, 269, 240 - 20, 15, percentage, TFT_WHITE, TFT_BLUE);

  tft.setTextPadding(0);
  tft.unloadFont();
}

/***************************************************************************************
**                          Draw the clock digits
***************************************************************************************/
void drawTime() {
  // Date — redraws every minute so midnight crossover is always correct
  tft.loadFont(AA_FONT_SMALL, LittleFS);
  time_t local_time = currentTZ()->toLocal(now(), &tz1_Code);
  String date = String(dayShortStr(weekday(local_time))) + "  " +
                String(monthShortStr(month(local_time))) + " " +
                String(day(local_time)) + "  " +
                String(year(local_time));
  tft.setTextDatum(BC_DATUM);
  tft.setTextColor(TFT_ORANGE, TFT_BLACK);
  tft.setTextPadding(tft.textWidth(" Www  Mmm 44  4444 "));
  tft.drawString(date, 120, 16);
  tft.unloadFont();

  tft.loadFont(AA_FONT_LARGE, LittleFS);

  // Convert UTC to local time, returns zone code in tz1_Code, e.g "GMT"
  local_time = currentTZ()->toLocal(now(), &tz1_Code);

  String timeNow = "";

  if (hour(local_time) < 10) timeNow += "0";
  timeNow += hour(local_time);
  timeNow += ":";
  if (minute(local_time) < 10) timeNow += "0";
  timeNow += minute(local_time);

  tft.setTextDatum(BC_DATUM);
  tft.setTextColor(TFT_YELLOW, TFT_BLACK);
  tft.setTextPadding(tft.textWidth(" 44:44 "));  // String width + margin
  tft.drawString(timeNow, 120, 53);

  drawSeparator(51);

  tft.setTextPadding(0);

  tft.unloadFont();

}

/***************************************************************************************
**                          Draw the current weather
***************************************************************************************/
void drawCurrentWeather() {
  String weatherText = "None";
  String weatherIcon = "";

  String currentSummary = forecast->main[0];
  currentSummary.toLowerCase();

  weatherIcon = getMeteoconIcon(forecast->id[0], now());

  ui.drawBmp("/icon/" + weatherIcon + ".bmp", 0, 53);

  // Weather Text
  if (language == "en")
    weatherText = forecast->main[0];
  else
    weatherText = forecast->description[0];

  tft.setTextDatum(BR_DATUM);
  tft.setTextColor(TFT_ORANGE, TFT_BLACK);

  int splitPoint = 0;
  int xpos = 235;
  splitPoint = splitIndex(weatherText);

  tft.setTextPadding(xpos - 100);  // xpos - icon width
  tft.drawString(splitPoint ? weatherText.substring(0, splitPoint) : weatherText, xpos, 69);

  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("feels " + String(forecast->feels_like[0], 0) + "o", xpos, 86);
  tft.setTextColor(TFT_ORANGE, TFT_BLACK);

  tft.setTextColor(TFT_YELLOW, TFT_BLACK);
  tft.setTextDatum(TR_DATUM);
  tft.setTextPadding(0);
  if (cfg.units == "metric") tft.drawString("oC", 237, 95);
  else tft.drawString("oF", 237, 95);

  //Temperature large digits added in updateData() to save swapping font here

  tft.setTextColor(TFT_ORANGE, TFT_BLACK);
  weatherText = String(forecast->wind_speed[0], 0);

  if (cfg.units == "metric") weatherText += " m/s";
  else weatherText += " mph";

  tft.setTextDatum(TC_DATUM);
  tft.setTextPadding(tft.textWidth("888 m/s"));  // Max string length?
  tft.drawString(weatherText, 124, 136);

  float curPressure = forecast->pressure[0];
  if (cfg.units == "imperial") {
    weatherText = String(curPressure, 2) + " in";
  } else {
    weatherText = String(curPressure, 0) + " hPa";
    if (prevPressure > 0.0f) {
      if      (curPressure > prevPressure + 0.5f) weatherText += "^";
      else if (curPressure < prevPressure - 0.5f) weatherText += "v";
    }
  }
  prevPressure = curPressure;

  tft.setTextDatum(TR_DATUM);
  tft.setTextPadding(tft.textWidth(" 8888hPa^"));
  tft.drawString(weatherText, 230, 136);

  int windAngle = (forecast->wind_deg[0] + 22.5) / 45;
  if (windAngle > 7) windAngle = 0;
  String wind[] = { "N", "NE", "E", "SE", "S", "SW", "W", "NW" };
  ui.drawBmp("/wind/" + wind[windAngle] + ".bmp", 101, 86);

  drawSeparator(153);

  tft.setTextDatum(TL_DATUM);  // Reset datum to normal
  tft.setTextPadding(0);       // Reset padding width to none
}

/***************************************************************************************
**                          Draw the 4 forecast columns
***************************************************************************************/
// draws the four forecast columns (next four 3-hour slots from now) using cached data
void drawForecast() {
  drawForecastDetail(8,   171, 0);
  drawForecastDetail(66,  171, 1);
  drawForecastDetail(124, 171, 2);
  drawForecastDetail(182, 171, 3);
  drawSeparator(171 + 69);
}

/***************************************************************************************
**                          Draw 1 forecast column at x, y
***************************************************************************************/
// helper for the forecast columns — uses cached slot data so it works during page cycling
void drawForecastDetail(uint16_t x, uint16_t y, uint8_t slotIndex) {
  if (slotIndex >= 4) return;
  SlotCache& s = slotCache[slotIndex];
  if (s.dt == 0) return;

  tft.setTextDatum(BC_DATUM);
  tft.setTextColor(TFT_ORANGE, TFT_BLACK);
  tft.setTextPadding(tft.textWidth("00:00"));
  tft.drawString(strTime(s.dt), x + 25, y);

  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.setTextPadding(tft.textWidth(" -88 "));
  tft.drawString(String(s.temp, 0), x + 25, y + 17);

  String weatherIcon = getMeteoconIcon(s.id, s.dt);
  ui.drawBmp("/icon50/" + weatherIcon + ".bmp", x, y + 18);

