pranavek/esp32-cyd-weather-station/src/Esp32_CYD_TFT_eSPI_OpenWeather_LittleFS_v02.ino
    // Calculate pair of coordinates for segment end
    int x2 = cos((i + 1 - 90) * DEG2RAD) * r + x;
    int y2 = sin((i + 1 - 90) * DEG2RAD) * r + y;

    tft.fillTriangle(x1, y1, x2, y2, x, y, colour);

    // Copy segment end to segment start for next segment
    x1 = x2;
    y1 = y2;
  }
}

/***************************************************************************************
**                          Get 3 hourly index at start of next day
***************************************************************************************/
int getNextSlotIndex(void) {
  time_t t = now();
  for (int i = 0; i < MAX_DAYS * 8; i++) {
    if (forecast->dt[i] > t) return i;
  }
  return 0;
}

/***************************************************************************************
**                          Backlight PWM helper
***************************************************************************************/
void setBacklight(uint8_t level) {
  ledcWrite(0, level);  // channel 0 (attached to TFT_BL in setup)
}

void updateBrightness(bool nightMode) {
  setBacklight(nightMode ? 0 : SCREEN_BRIGHTNESS);
}

/***************************************************************************************
**                          Cache forecast data before forecast pointer is freed
***************************************************************************************/
void cacheForecastData(void) {
  // Slot cache: next 4 three-hour slots
  int start = getNextSlotIndex();
  for (int i = 0; i < 4; i++) {
    int idx = start + i;
    if (idx < MAX_DAYS * 8) {
      slotCache[i].dt   = forecast->dt[idx];
      slotCache[i].temp = forecast->temp[idx];
      slotCache[i].id   = forecast->id[idx];
      slotCache[i].pop  = forecast->pop[idx];
    } else {
      slotCache[i].dt = 0;
    }
  }

  // Day cache: aggregate by calendar day, skip today, take next 4 days
  for (int d = 0; d < 4; d++) {
    dayCache[d].dow = 0;
    dayCache[d].high = -1000.0f;
    dayCache[d].low  =  1000.0f;
    dayCache[d].id   = 0;
    dayCache[d].pop  = 0.0f;
  }
  time_t nowLocal = currentTZ()->toLocal(now(), &tz1_Code);
  int todayDay = day(nowLocal);
  int filled = 0;
  int lastDayKey = todayDay;
  int dayBestSlotIdx = -1;
  uint8_t dayBestHourDist = 24;
  for (int i = 0; i < MAX_DAYS * 8 && filled < 4; i++) {
    time_t local = currentTZ()->toLocal(forecast->dt[i], &tz1_Code);
    int dKey = day(local);
    if (dKey == todayDay) continue;
    if (filled == 0 || dKey != lastDayKey) {
      // commit previous day's representative id from best slot
      if (filled > 0 && dayBestSlotIdx >= 0) {
        dayCache[filled - 1].id = forecast->id[dayBestSlotIdx];
      }
      if (filled >= 4) break;
      lastDayKey = dKey;
      dayCache[filled].dow = weekday(local);  // 1..7
      dayBestSlotIdx = i;
      dayBestHourDist = abs((int)hour(local) - 13);
      filled++;
    } else {
      uint8_t hd = abs((int)hour(local) - 13);
      if (hd < dayBestHourDist) {
        dayBestHourDist = hd;
        dayBestSlotIdx = i;
      }
    }
    DayCache& dc = dayCache[filled - 1];
    if (forecast->temp_max[i] > dc.high) dc.high = forecast->temp_max[i];
    if (forecast->temp_min[i] < dc.low)  dc.low  = forecast->temp_min[i];
    if (forecast->pop[i]      > dc.pop)  dc.pop  = forecast->pop[i];
  }
  // commit last day's icon id
  if (filled > 0 && dayBestSlotIdx >= 0) {
    dayCache[filled - 1].id = forecast->id[dayBestSlotIdx];
  }

  // Singleton fields
  cachedSunrise    = forecast->sunrise;
  cachedSunset     = forecast->sunset;
  cachedHumidity   = forecast->humidity[0];
  cachedClouds     = forecast->clouds_all[0];
  // Moon
  time_t local0 = currentTZ()->toLocal(forecast->dt[0], &tz1_Code);
  int ip;
  cachedMoonIcon     = moon_phase(year(local0), month(local0), day(local0), hour(local0), &ip);
  cachedMoonPhaseIdx = ip;

  cacheValid = true;
}

/***************************************************************************************
**                          Page dispatcher
***************************************************************************************/
void drawBottomSections(void) {
  if (!cacheValid) return;
  switch (currentPage) {
    case 0:  // Hourly forecast + Astronomy
      drawForecast();
      drawAstronomy();
      break;
    case 1:  // 4-day forecast + random quote
      drawDailyForecast();
      drawSeparator(240);
      drawQuote();
      break;
  }
}

/***************************************************************************************
**                          Page 2 — Random quote
***************************************************************************************/
void drawQuote(void) {
  static const char* quotes[] = {
    "Be your own hero.",
    "Growth requires change.",
    "Progress over perfection.",
    "Keep moving forward.",
    "Trust the process.",
    "Learn from everything.",
    "Rise above it.",
    "Own your story.",
    "Make it happen.",
    "Less talk, more action.",
    "Dream big, act.",
    "Fortune favors bold.",
    "Seize the day.",
    "Begin the work.",
    "Success takes time.",
    "Stay hungry, stay humble.",
    "This too passes.",
    "Simple is beautiful.",
    "Choose kindness always.",
    "Breathe and release.",
    "Focus on good.",
    "Live and let live.",
    "Mind over matter.",
    "Silence is powerful.",
    "Integrity is everything.",
    "Courage over comfort.",
    "Stay true, stay you.",
    "Lead with heart.",
    "Grit defines you.",
    "Strength in softness.",
  };
  const uint8_t QUOTE_COUNT = sizeof(quotes) / sizeof(quotes[0]);
  uint8_t idx = (uint8_t)(esp_random() % QUOTE_COUNT);
  tft.setTextDatum(MC_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.setTextPadding(230);
  tft.drawString(quotes[idx], 120, 280);
  tft.setTextPadding(0);
}

/***************************************************************************************
**                          4-day daily forecast columns
***************************************************************************************/
static const char* dowAbbrev(uint8_t dow) {
  // weekday() returns 1=Sun..7=Sat
  static const char* names[8] = { "?", "Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat" };
  if (dow < 1 || dow > 7) return "?";
  return names[dow];
}

void drawDailyForecast(void) {
  // 4 columns at x = 8, 66, 124, 182 — same layout as 3-hour strip
  for (int i = 0; i < 4; i++) {
    DayCache& d = dayCache[i];
    int x = 8 + i * 58;
    int y = 171;
    if (d.dow == 0) continue;

    tft.setTextDatum(BC_DATUM);
    tft.setTextColor(TFT_ORANGE, TFT_BLACK);
    tft.setTextPadding(tft.textWidth("Wed"));
    tft.drawString(dowAbbrev(d.dow), x + 25, y);

    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.setTextPadding(tft.textWidth("-88/-88"));
    tft.drawString(String(d.high, 0) + "/" + String(d.low, 0), x + 25, y + 17);

